{
    "recipe": "Mughlai Biryani",
    "ingredients": [
        "500g basmati rice",
        "700g chicken (bone-in pieces) or mutton",
        "1 cup thick curd (yogurt)",
        "2 large onions (thinly sliced)",
        "1 tbsp ginger-garlic paste",
        "10-12 cashew nuts",
        "8-10 almonds (blanched and peeled)",
        "2 tbsp fresh cream",
        "1/4 cup milk",
        "A few saffron strands",
        "2 tbsp ghee (clarified butter)",
        "2 tbsp oil",
        "1 tbsp rose water",
        "1 tbsp kewra water",
        "Whole spices (4 green cardamoms, 2 black cardamoms, 1 bay leaf, 1-inch cinnamon stick, 4 cloves)",
        "1/2 tsp nutmeg powder",
        "1/2 tsp mace (javitri) powder",
        "1 tsp garam masala powder",
        "1/2 tsp white pepper powder",
        "1/2 tsp turmeric powder",
        "1/2 tsp red chili powder",
        "Salt to taste",
        "Fresh coriander leaves (chopped)",
        "Fresh mint leaves (chopped)",
        "Water (for boiling rice)"
    ],
    "steps": [
        {
            "title": "Soak Rice",
            "description": "Wash the basmati rice thoroughly under running water. Soak it in water for 30 minutes, then drain."
        },
        {
            "title": "Soak Saffron",
            "description": "Warm the milk slightly and add saffron strands. Let it infuse and set aside."
        },
        {
            "title": "Fry Onions",
            "description": "Heat oil in a pan. Add thinly sliced onions and fry until golden brown and crisp. Stir occasionally to prevent burning."
        },
        {
            "title": "Separate Fried Onions",
            "description": "Once fried, drain onions on paper towel. Set aside half for garnishing and use the other half for marination."
        },
        {
            "title": "Prepare Nut Paste",
            "description": "Grind cashew nuts and peeled almonds with a little water or milk to make a smooth, thick paste."
        },
        {
            "title": "Mix Marinade",
            "description": "In a large bowl, combine curd, ginger-garlic paste, nut paste, fresh cream, garam masala, turmeric, red chili powder, white pepper, nutmeg, mace powder, salt, and half of the fried onions."
        },
        {
            "title": "Marinate Meat",
            "description": "Add chicken or mutton pieces to the marinade. Mix well and let it rest for at least 1 hour, preferably in the refrigerator."
        },
        {
            "title": "Heat Ghee and Whole Spices",
            "description": "In a heavy-bottomed pan or handi, heat ghee. Add whole spices: cardamoms, bay leaf, cinnamon stick, and cloves. Sauté for a few seconds until aromatic."
        },
        {
            "title": "Cook Marinated Meat",
            "description": "Add the marinated meat to the pan. Cook on medium heat, stirring occasionally."
        },
        {
            "title": "Simmer Until Tender",
            "description": "Cover and cook until the meat is tender and oil starts to separate from the masala. Add a little water if needed."
        },
        {
            "title": "Boil Water for Rice",
            "description": "In a large pot, bring water to a boil. Add salt and optional whole spices (e.g., a bay leaf, cardamom)."
        },
        {
            "title": "Parboil Rice",
            "description": "Add soaked rice to the boiling water. Cook until 70% done (grains should still have a slight bite), then drain thoroughly."
        },
        {
            "title": "Start Biryani Layering",
            "description": "In a thick-bottomed pan or handi, spread a layer of cooked meat with masala at the bottom."
        },
        {
            "title": "Add Rice Layer",
            "description": "Spread a layer of parboiled rice evenly over the meat layer."
        },
        {
            "title": "Add Aromatics",
            "description": "Drizzle the saffron-infused milk, rose water, and kewra water over the rice."
        },
        {
            "title": "Add Herbs and Onions",
            "description": "Sprinkle chopped mint leaves, coriander leaves, and the remaining fried onions on top."
        },
        {
            "title": "Seal the Pot",
            "description": "Cover the pan with a tight-fitting lid or seal with dough to trap the steam."
        },
        {
            "title": "Dum Cook the Biryani",
            "description": "Cook on low heat for 20–25 minutes to allow flavors to meld using the traditional 'dum' method."
        },
        {
            "title": "Rest Before Serving",
            "description": "Let the biryani rest for 5–10 minutes after turning off the heat before opening the lid."
        },
        {
            "title": "Serve Mughlai Biryani",
            "description": "Gently mix the layers before serving to preserve texture. Serve hot with raita or salan."
        },
        {
            "title": "Miscellaneous / Intro & Outro",
            "description": "Covers all non-recipe content such as video greetings, channel promotions, personal stories, thanks messages, like/share/subscribe prompts, and other commentary unrelated to cooking instructions."
        }
    ]
}