{
    "recipe": "Kolkata Biryani",
    "ingredients": [
        "1 kg Basmati rice",
        "1 kg Mutton (bone-in, preferably from the shoulder or leg)",
        "2 large Potatoes (peeled and halved)",
        "4 boiled Eggs (optional but traditional)",
        "2 cups Yogurt",
        "1/2 cup Mustard oil",
        "3 large Onions (thinly sliced)",
        "2 tbsp Ginger paste",
        "2 tbsp Garlic paste",
        "1/4 cup Ghee",
        "1/2 tsp Saffron strands",
        "1/2 cup warm Milk (for saffron)",
        "1 tsp Rose water",
        "1 tsp Kewra water",
        "1 tsp Biryani masala (preferably Kolkata-style)",
        "1 tsp Garam masala powder",
        "2 Bay leaves",
        "4 Green cardamoms",
        "4 Cloves",
        "1-inch Cinnamon stick",
        "1 Mace blade",
        "1 Nutmeg (small grated amount)",
        "Salt to taste",
        "Sugar to taste"
    ],
    "steps": [
        {
            "title": "Prepare the marinade",
            "description": "In a large bowl, mix yogurt, ginger paste, garlic paste, biryani masala, salt, and a pinch of sugar until well combined."
        },
        {
            "title": "Marinate the mutton",
            "description": "Add the mutton to the marinade and coat evenly. Cover and refrigerate for at least 4 hours, preferably overnight."
        },
        {
            "title": "Prep the potatoes",
            "description": "Peel the potatoes, cut them in half, and rub them with salt and turmeric."
        },
        {
            "title": "Fry the potatoes",
            "description": "Heat mustard oil in a pan and shallow fry the potatoes until golden on all sides. Set aside."
        },
        {
            "title": "Slice the onions",
            "description": "Thinly slice the onions for frying."
        },
        {
            "title": "Fry the onions (beresta)",
            "description": "Deep fry the sliced onions in hot oil until golden brown and crisp. Drain on paper towels and set aside."
        },
        {
            "title": "Heat whole spices",
            "description": "In a large heavy-bottom pot, heat mustard oil and add bay leaves, cloves, cardamoms, cinnamon, mace, and nutmeg."
        },
        {
            "title": "Cook the mutton",
            "description": "Add the marinated mutton to the pot. Cook on medium-high heat until the meat starts to brown and the oil begins to separate."
        },
        {
            "title": "Add fried potatoes to mutton",
            "description": "Once the mutton is nearly tender, add the fried potatoes and cook together for a few minutes to absorb flavor."
        },
        {
            "title": "Soak saffron",
            "description": "In a small bowl, soak saffron strands in warm milk for 10 minutes."
        },
        {
            "title": "Add aromatic waters",
            "description": "Mix rose water and kewra water into the saffron milk. Set aside."
        },
        {
            "title": "Parboil the rice",
            "description": "Boil a large pot of water with salt and whole garam masalas. Add rinsed basmati rice and cook until 70% done. Drain immediately."
        },
        {
            "title": "Grease the biryani pot",
            "description": "Lightly grease the base of a heavy-bottomed pot with ghee."
        },
        {
            "title": "First layer - mutton and potatoes",
            "description": "Spread a layer of cooked mutton and potatoes at the bottom of the pot."
        },
        {
            "title": "Second layer - rice",
            "description": "Add a layer of the parboiled rice over the mutton."
        },
        {
            "title": "Add toppings to layer",
            "description": "Sprinkle fried onions, garam masala powder, a few drops of ghee, and a portion of the saffron milk mixture over the rice."
        },
        {
            "title": "Repeat layers",
            "description": "Repeat the layering with the remaining mutton, rice, and toppings, finishing with rice on top."
        },
        {
            "title": "Seal the pot",
            "description": "Cover the pot with a tight lid or seal it with dough to trap the steam."
        },
        {
            "title": "Dum cook the biryani",
            "description": "Place the sealed pot over a low flame or a griddle and cook for 30–40 minutes to allow flavors to meld."
        },
        {
            "title": "Rest the biryani",
            "description": "Turn off the heat and let the biryani rest, covered, for 10 minutes before opening."
        },
        {
            "title": "Serve",
            "description": "Serve hot with boiled eggs, raita, or salad."
        },
        {
            "title": "Miscellaneous / Intro & Outro",
            "description": "Covers all non-recipe content such as video greetings, channel promotions, personal stories, thanks messages, like/share/subscribe prompts, and other commentary unrelated to cooking instructions."
        }
    ]
}