{
    "recipe": "Hyderabadi Biryani",
    "ingredients": [
        "2 cups basmati rice (long grain, aged)",
        "500 grams chicken (bone-in, cut into pieces)",
        "1 cup plain yogurt (thick)",
        "2 large onions (thinly sliced)",
        "1/4 cup mint leaves (fresh)",
        "1/4 cup coriander leaves (fresh)",
        "1 tablespoon ginger-garlic paste",
        "2-3 green chilies (slit)",
        "1/2 teaspoon turmeric powder",
        "1 teaspoon red chili powder",
        "1 teaspoon garam masala powder",
        "1/2 teaspoon coriander powder",
        "Whole spices: 4 cloves, 2 cardamom pods, 1 bay leaf, 1-inch cinnamon stick, 1 star anise, 4 black peppercorns",
        "1/2 cup milk (warm)",
        "A few strands of saffron",
        "2 tablespoons lemon juice",
        "4 tablespoons ghee",
        "2 tablespoons cooking oil",
        "Salt to taste",
        "Water (as needed for boiling rice)"
    ],
    "steps": [
        {
            "title": "Prepare Marinade",
            "description": "In a bowl, combine yogurt, ginger-garlic paste, turmeric, red chili powder, coriander powder, garam masala, lemon juice, and salt. Mix well to form a marinade."
        },
        {
            "title": "Marinate Chicken",
            "description": "Add chicken pieces to the marinade along with green chilies, half of the mint and coriander leaves. Mix thoroughly and cover. Refrigerate for at least 4 hours or overnight."
        },
        {
            "title": "Slice and Fry Onions",
            "description": "Thinly slice the onions. Heat oil in a deep pan over medium heat and fry the onions in batches until golden brown and crispy."
        },
        {
            "title": "Drain Fried Onions",
            "description": "Remove fried onions and place on paper towels to absorb excess oil. Set aside half for layering later."
        },
        {
            "title": "Add Onions to Marinade",
            "description": "Mix the remaining half of the fried onions into the marinated chicken."
        },
        {
            "title": "Rinse and Soak Rice",
            "description": "Rinse basmati rice thoroughly under cold water until the water runs clear. Soak the rice in water for 30 minutes."
        },
        {
            "title": "Prepare Saffron Milk",
            "description": "Warm the milk slightly and add saffron strands. Let it sit for 10–15 minutes to release color and aroma."
        },
        {
            "title": "Boil Water with Whole Spices",
            "description": "In a large pot, bring water to a boil. Add salt and whole spices (cloves, cardamom, bay leaf, cinnamon, star anise, peppercorns)."
        },
        {
            "title": "Parboil the Rice",
            "description": "Drain soaked rice and add it to the boiling spiced water. Cook until the rice is 70% done—grains should still be slightly firm. Drain the rice immediately."
        },
        {
            "title": "Prepare for Layering",
            "description": "Grease the bottom of a heavy-bottomed pot with a little ghee. Spread the marinated chicken evenly as the bottom layer."
        },
        {
            "title": "Layer the Rice",
            "description": "Spread the parboiled rice evenly over the chicken layer."
        },
        {
            "title": "Add Final Garnishes",
            "description": "Top with the reserved fried onions, remaining mint and coriander leaves, saffron milk, and drizzle with ghee."
        },
        {
            "title": "Seal the Pot",
            "description": "Cover the pot with a tight-fitting lid or seal the edges with dough to trap steam inside."
        },
        {
            "title": "Cook on High and Low Heat",
            "description": "Place the sealed pot on high heat for 5 minutes. Then reduce to very low heat and let cook (dum) for 25–30 minutes."
        },
        {
            "title": "Rest the Biryani",
            "description": "Turn off the heat and let the biryani sit for 10 minutes to settle and absorb flavors."
        },
        {
            "title": "Serve",
            "description": "Gently fluff the rice with a flat spoon without breaking the grains. Serve hot with raita, salad, or mirchi ka salan."
        },
        {
            "title": "Miscellaneous / Intro & Outro",
            "description": "Covers all non-recipe content such as video greetings, channel promotions, personal stories, thanks messages, like/share/subscribe prompts, and other commentary unrelated to cooking instructions."
        }
    ]
}