{
    "recipe": "Kashmiri Biryani",
    "ingredients": [
        "2 cups basmati rice",
        "500 grams mutton (bone-in, cleaned)",
        "1 cup yogurt (thick, full-fat)",
        "2 large onions (thinly sliced)",
        "1/4 cup ghee (clarified butter)",
        "2 tablespoons oil",
        "1/2 cup milk (warm)",
        "A few strands of saffron",
        "2 teaspoons ginger paste",
        "2 teaspoons garlic paste",
        "1/2 teaspoon turmeric powder",
        "1 teaspoon red chili powder (Kashmiri variety, mild)",
        "1 teaspoon fennel powder (key Kashmiri spice)",
        "1/2 teaspoon dry ginger powder (saunth)",
        "1 teaspoon garam masala",
        "4 green cardamoms",
        "2 black cardamoms",
        "4 cloves",
        "1 cinnamon stick",
        "1 bay leaf",
        "1 star anise",
        "1/4 cup fried cashews",
        "1/4 cup raisins",
        "Salt to taste",
        "Fresh coriander leaves for garnish",
        "Fresh mint leaves for garnish",
        "2 tablespoons rose water",
        "1 tablespoon kewra water (optional, for aroma)"
    ],
    "steps": [
        {
            "title": "Prepare the Mutton Marinade",
            "description": "In a bowl, add yogurt, ginger paste, garlic paste, turmeric powder, red chili powder, fennel powder, dry ginger powder, and salt."
        },
        {
            "title": "Marinate the Mutton",
            "description": "Add the cleaned mutton to the marinade. Mix thoroughly until the mutton is evenly coated. Cover and refrigerate for at least 2 hours or overnight for best flavor."
        },
        {
            "title": "Rinse and Soak the Rice",
            "description": "Rinse the basmati rice under cold water until the water runs clear. Soak the rice in water for 30 minutes. Drain before cooking."
        },
        {
            "title": "Slice the Onions",
            "description": "Thinly slice the onions and set aside for frying."
        },
        {
            "title": "Fry the Onions",
            "description": "Heat oil and half of the ghee in a large pan. Add sliced onions and fry on medium heat until golden brown and caramelized. Remove half and keep aside for layering later."
        },
        {
            "title": "Temper Whole Spices",
            "description": "In the same pan with remaining onions, add green cardamoms, black cardamoms, cloves, cinnamon, bay leaf, and star anise. Sauté for 30 seconds until fragrant."
        },
        {
            "title": "Cook the Mutton",
            "description": "Add the marinated mutton to the pan. Cook on medium heat, stirring occasionally, until the meat is tender and oil starts to separate from the masala."
        },
        {
            "title": "Boil Water for Rice",
            "description": "In a separate large pot, bring water to a boil and add salt to taste."
        },
        {
            "title": "Parboil the Rice",
            "description": "Add the soaked rice to the boiling water. Cook until the grains are 70% done—firm but not fully cooked. Drain the rice and set aside."
        },
        {
            "title": "Soak Saffron in Milk",
            "description": "Warm the milk slightly. Add saffron strands to the milk and let it infuse for at least 10 minutes."
        },
        {
            "title": "Prepare for Layering",
            "description": "Chop fresh coriander and mint leaves. Keep rose water, kewra water, raisins, cashews, and fried onions ready."
        },
        {
            "title": "First Layer of Mutton",
            "description": "In a heavy-bottomed pot, spread half of the cooked mutton evenly at the bottom."
        },
        {
            "title": "First Layer of Rice and Garnishes",
            "description": "Add a layer of half the rice over the mutton. Sprinkle half of the fried onions, raisins, cashews, saffron milk, rose water, kewra water (optional), and herbs."
        },
        {
            "title": "Second Layer of Mutton",
            "description": "Spread the remaining mutton on top of the rice layer."
        },
        {
            "title": "Second Layer of Rice and Garnishes",
            "description": "Add the remaining rice and repeat the garnishing with leftover fried onions, raisins, cashews, saffron milk, rose water, and herbs."
        },
        {
            "title": "Add Ghee and Seal Pot",
            "description": "Drizzle remaining ghee on top. Seal the pot tightly with dough or foil and place a lid over it."
        },
        {
            "title": "Dum Cooking (Steam Method)",
            "description": "Place the sealed pot over a low flame or on a heavy skillet (tava) to avoid direct heat. Let it cook for 20–25 minutes, allowing flavors to meld."
        },
        {
            "title": "Rest and Serve",
            "description": "Turn off the heat and let the biryani rest for 10 minutes. Gently mix before serving to retain the long grains. Serve hot with raita or Kashmiri chutney."
        },
        {
            "title": "Miscellaneous / Intro & Outro",
            "description": "Covers all non-recipe content such as video greetings, channel promotions, personal stories, thanks messages, like/share/subscribe prompts, and other commentary unrelated to cooking instructions."
        }
    ]
}