{
    "recipe": "Malabar Chicken Biryani",
    "ingredients": [
        "1 kg chicken (bone-in, cut into medium pieces)",
        "3 cups basmati rice (or Jeerakasala rice for authenticity)",
        "3 large onions (thinly sliced)",
        "2 tomatoes (chopped)",
        "1 cup yogurt",
        "1 tablespoon ginger-garlic paste",
        "2-3 green chilies (slit)",
        "1/2 teaspoon turmeric powder",
        "1 tablespoon red chili powder",
        "1 tablespoon coriander powder",
        "1/2 teaspoon garam masala",
        "Whole spices (4 cardamoms, 4 cloves, 2-inch cinnamon, 1 bay leaf)",
        "1/2 cup chopped mint leaves",
        "1/2 cup chopped coriander leaves",
        "Juice of 1 lemon",
        "4 tablespoons ghee (clarified butter)",
        "3 tablespoons refined oil or coconut oil",
        "Cashew nuts and raisins (for garnish)",
        "Salt to taste",
        "Water as required"
    ],
    "steps": [
        {
            "title": "Soak the Rice",
            "description": "Wash the basmati or Jeerakasala rice thoroughly and soak it in water for 30 minutes."
        },
        {
            "title": "Cook the Rice",
            "description": "Boil water in a large pot, add salt and whole spices (cardamom, cloves, cinnamon, bay leaf). Add soaked rice and cook until it is 90% done. Drain the rice and set it aside."
        },
        {
            "title": "Fry Onions",
            "description": "Heat oil and 2 tablespoons of ghee in a deep pan. Fry the thinly sliced onions on medium heat until golden brown and crispy."
        },
        {
            "title": "Separate Onions for Garnish",
            "description": "Remove half of the fried onions and set them aside for garnishing later."
        },
        {
            "title": "Sauté Whole Spices",
            "description": "In the remaining oil, add whole spices (if not already used in rice) and sauté briefly until aromatic."
        },
        {
            "title": "Add Ginger-Garlic and Chilies",
            "description": "Add ginger-garlic paste and slit green chilies. Sauté until the raw smell disappears."
        },
        {
            "title": "Cook Onions for Masala",
            "description": "Add the remaining fried onions back into the pan and sauté for a few minutes until soft and well-mixed."
        },
        {
            "title": "Add Tomatoes and Spices",
            "description": "Add chopped tomatoes, turmeric powder, red chili powder, and coriander powder. Cook until the tomatoes are soft and oil starts separating from the masala."
        },
        {
            "title": "Add Yogurt",
            "description": "Lower the heat and stir in the yogurt. Mix well to form a thick gravy base."
        },
        {
            "title": "Cook Chicken",
            "description": "Add the chicken pieces. Mix to coat them well with the masala. Cover and cook until the chicken is tender and cooked through."
        },
        {
            "title": "Reduce Masala",
            "description": "Uncover and continue to cook until the gravy thickens and clings to the chicken."
        },
        {
            "title": "Prepare for Layering",
            "description": "Grease the bottom of a heavy-bottomed pot with a little ghee. Spoon in half of the chicken masala as the first layer."
        },
        {
            "title": "Layer Rice and Garnishes",
            "description": "Add a layer of cooked rice over the chicken. Sprinkle fried onions, chopped mint, coriander leaves, lemon juice, and a drizzle of ghee."
        },
        {
            "title": "Repeat Layers",
            "description": "Repeat layering with remaining chicken, rice, and garnishes. Ensure the final layer is rice topped with fried onions and herbs."
        },
        {
            "title": "Seal the Pot",
            "description": "Seal the lid tightly or use dough to secure the edges, preventing steam from escaping during cooking."
        },
        {
            "title": "Dum Cook the Biryani",
            "description": "Place the pot on low heat or on a preheated griddle (tava) and cook for 20-25 minutes. This slow steaming helps flavors meld beautifully."
        },
        {
            "title": "Fry Cashews and Raisins",
            "description": "In a small pan, heat remaining ghee and fry cashew nuts and raisins until golden."
        },
        {
            "title": "Garnish and Serve",
            "description": "Open the biryani pot carefully. Sprinkle the fried cashews and raisins on top. Serve hot with raita, pickle, and pappadam."
        },
        {
            "title": "Miscellaneous / Intro & Outro",
            "description": "Covers all non-recipe content such as video greetings, channel promotions, personal stories, thanks messages, like/share/subscribe prompts, and other commentary unrelated to cooking instructions."
        }
    ]
}