{
    "recipe": "Bombay Biryani",
    "ingredients": [
        "2 cups basmati rice",
        "500 grams bone-in chicken or mutton",
        "2 large onions, thinly sliced",
        "2 tomatoes, chopped",
        "1/2 cup plain yogurt",
        "2 medium potatoes, peeled and halved",
        "1/4 cup chopped coriander leaves",
        "1/4 cup chopped mint leaves",
        "4 dried plums (alu Bukhara)",
        "1 tablespoon ginger-garlic paste",
        "2-3 green chilies, slit",
        "1/2 teaspoon turmeric powder",
        "1 teaspoon red chili powder",
        "1 teaspoon garam masala",
        "1/2 teaspoon biryani masala (Bombay-style)",
        "1/2 teaspoon ground black pepper",
        "Salt to taste",
        "Whole spices (4 cloves, 2 bay leaves, 4 green cardamoms, 1-inch cinnamon stick, 1 black cardamom)",
        "2 tablespoons lemon juice",
        "1 tablespoon kewra water",
        "1 tablespoon rose water (optional)",
        "A pinch of saffron soaked in 2 tablespoons warm milk",
        "3 tablespoons ghee",
        "2 tablespoons cooking oil",
        "Water as needed for boiling rice"
    ],
    "steps": [
        {
            "title": "Rinse the Rice",
            "description": "Place basmati rice in a bowl and rinse under cold water until the water runs clear to remove excess starch."
        },
        {
            "title": "Soak the Rice",
            "description": "Soak the rinsed rice in enough water for 30 minutes to allow it to soften slightly."
        },
        {
            "title": "Boil Water for Rice",
            "description": "In a large pot, bring plenty of water to a boil. Add salt and whole spices (cloves, bay leaves, cardamoms, cinnamon, etc.)."
        },
        {
            "title": "Parboil the Rice",
            "description": "Add soaked rice to boiling water and cook until it's about 70% done (firm but not fully soft). Then drain and set aside."
        },
        {
            "title": "Heat Oil and Ghee",
            "description": "In a deep pan, heat the cooking oil and ghee together over medium heat."
        },
        {
            "title": "Fry the Onions",
            "description": "Add sliced onions to the hot oil and ghee. Fry until golden brown and crispy. Remove half and set aside for garnish."
        },
        {
            "title": "Add Ginger-Garlic Paste",
            "description": "To the remaining onions in the pan, add ginger-garlic paste and sauté for 1-2 minutes until the raw smell disappears."
        },
        {
            "title": "Add Chicken or Mutton",
            "description": "Add the cleaned chicken or mutton pieces to the pan. Cook on medium-high heat until the meat is browned on all sides."
        },
        {
            "title": "Add Chopped Tomatoes",
            "description": "Stir in chopped tomatoes and cook until they soften and blend into the mixture."
        },
        {
            "title": "Add Ground Spices and Salt",
            "description": "Add turmeric powder, red chili powder, black pepper, biryani masala, and salt. Cook until the oil begins to separate."
        },
        {
            "title": "Stir in Yogurt",
            "description": "Lower the heat and add the plain yogurt. Stir quickly to avoid curdling and cook until the yogurt is well incorporated."
        },
        {
            "title": "Add Dried Plums and Chilies",
            "description": "Add dried plums (alu Bukhara) and slit green chilies. Simmer the mixture until the meat becomes tender."
        },
        {
            "title": "Fry the Potatoes",
            "description": "In a separate pan, lightly fry the halved potatoes until golden and slightly crisp on the edges."
        },
        {
            "title": "Add Potatoes to Meat",
            "description": "Add the fried potatoes to the meat mixture and stir gently to coat them in the masala."
        },
        {
            "title": "Start Layering - First Rice Layer",
            "description": "In a large, heavy-bottomed pot, add half of the parboiled rice as the first layer."
        },
        {
            "title": "Add Meat and Potato Layer",
            "description": "Spread the entire cooked meat and potato mixture evenly over the rice layer."
        },
        {
            "title": "Top with Remaining Rice",
            "description": "Cover the meat layer with the remaining half of the rice."
        },
        {
            "title": "Add Garnish and Aromatics",
            "description": "Sprinkle fried onions, chopped coriander, mint leaves, lemon juice, kewra water, rose water (if using), and saffron milk on top."
        },
        {
            "title": "Seal the Pot",
            "description": "Cover the pot with a tight lid or seal it with dough to trap the steam (dum)."
        },
        {
            "title": "Cook on Dum",
            "description": "Place the sealed pot on low heat and cook for 20-25 minutes to allow flavors to meld and rice to finish cooking."
        },
        {
            "title": "Rest Before Serving",
            "description": "Let the biryani rest for 5-10 minutes after dum cooking before opening the lid."
        },
        {
            "title": "Mix and Serve",
            "description": "Gently fluff the rice and mix slightly to distribute meat and potatoes. Serve hot with raita or salad."
        },
        {
            "title": "Miscellaneous / Intro & Outro",
            "description": "Covers all non-recipe content such as video greetings, channel promotions, personal stories, thanks messages, like/share/subscribe prompts, and other commentary unrelated to cooking instructions."
        }
    ]
}