{
    "recipe": "Donne Biryani",
    "ingredients": [
        "500g chicken (bone-in, medium pieces)",
        "2 cups Seeraga Samba rice (or Jeerakasala rice)",
        "2 medium onions, thinly sliced",
        "2 tomatoes, chopped",
        "1 cup fresh coriander leaves",
        "1 cup fresh mint leaves",
        "8-10 green chilies (adjust to taste)",
        "1 tablespoon ginger-garlic paste",
        "1/2 cup curd (yogurt)",
        "1/2 teaspoon turmeric powder",
        "1 teaspoon red chili powder",
        "1 teaspoon garam masala powder",
        "2 bay leaves",
        "4-5 cloves",
        "2-3 cardamom pods",
        "1 small piece cinnamon",
        "1/2 teaspoon fennel seeds",
        "4 tablespoons ghee",
        "4 tablespoons oil",
        "Salt to taste",
        "Water (as needed for rice)",
        "Donne leaves or banana leaves for serving (optional but traditional)"
    ],
    "steps": [
        {
            "title": "Make green masala paste",
            "description": "Combine fresh coriander leaves, mint leaves, and green chilies in a blender."
        },
        {
            "title": "Grind green masala",
            "description": "Add a little water and grind the mixture into a smooth, fine green paste."
        },
        {
            "title": "Begin chicken marination",
            "description": "Place the chicken pieces in a large mixing bowl."
        },
        {
            "title": "Add spices and yogurt",
            "description": "Add turmeric powder, red chili powder, salt, curd, and ginger-garlic paste to the chicken."
        },
        {
            "title": "Mix in green masala",
            "description": "Add the prepared green masala paste to the bowl and mix thoroughly to coat the chicken."
        },
        {
            "title": "Marinate the chicken",
            "description": "Cover and let the chicken marinate for at least 30 minutes to absorb the flavors."
        },
        {
            "title": "Wash and soak rice",
            "description": "Rinse the Seeraga Samba rice until the water runs clear, then soak it in water for 20 minutes."
        },
        {
            "title": "Parboil the rice",
            "description": "Boil water in a large pot, add salt and a few drops of oil, then add the soaked rice and cook until 80% done."
        },
        {
            "title": "Drain and set aside rice",
            "description": "Once 80% cooked, drain the rice in a colander and let it rest."
        },
        {
            "title": "Heat ghee and oil",
            "description": "In a heavy-bottomed pan, heat ghee and oil on medium heat."
        },
        {
            "title": "Add whole spices",
            "description": "Add bay leaves, cloves, cardamom, cinnamon, and fennel seeds to the hot ghee-oil mix. Sauté until aromatic."
        },
        {
            "title": "Sauté onions",
            "description": "Add thinly sliced onions to the pan and cook until they turn golden brown."
        },
        {
            "title": "Add tomatoes",
            "description": "Add chopped tomatoes and cook until they soften and blend into the onion mixture."
        },
        {
            "title": "Add marinated chicken",
            "description": "Add the marinated chicken along with all the marinade to the pan."
        },
        {
            "title": "Cook chicken",
            "description": "Cook on medium heat, stirring occasionally, until the chicken is about 80% cooked and the masala thickens."
        },
        {
            "title": "Layer rice over chicken",
            "description": "Evenly spread the partially cooked rice over the chicken in the pan."
        },
        {
            "title": "Sprinkle garam masala",
            "description": "Sprinkle garam masala powder evenly over the layered rice."
        },
        {
            "title": "Seal and dum cook",
            "description": "Cover the pan tightly with a lid. Optionally seal edges with dough and cook on low heat for 15–20 minutes."
        },
        {
            "title": "Let biryani rest",
            "description": "Turn off the heat and let the biryani rest, covered, for 10 minutes to allow flavors to settle."
        },
        {
            "title": "Gently mix and serve",
            "description": "Open the lid, gently fluff and mix the biryani without breaking the rice grains. Serve hot in donne or banana leaves if available."
        },
        {
            "title": "Miscellaneous / Intro & Outro",
            "description": "Covers all non-recipe content such as video greetings, channel promotions, personal stories, thanks messages, like/share/subscribe prompts, and other commentary unrelated to cooking instructions."
        }
    ]
}