{
    "recipe": "Thalassery Biryani",
    "ingredients": [
        "500g chicken (bone-in, medium pieces)",
        "3 cups jeerakasala rice (Kaima rice)",
        "4 medium onions (thinly sliced)",
        "2 tomatoes (chopped)",
        "1/2 cup yogurt",
        "2 tbsp ginger-garlic paste",
        "2-3 green chilies (slit)",
        "1/4 cup chopped mint leaves",
        "1/4 cup chopped coriander leaves",
        "1 tsp garam masala",
        "1/2 tsp turmeric powder",
        "1 tsp red chili powder",
        "1 tsp coriander powder",
        "Whole spices (4 cloves, 4 cardamoms, 1-inch cinnamon, 1 bay leaf)",
        "2 tbsp ghee",
        "3 tbsp refined oil or coconut oil",
        "Cashews and raisins (for garnishing)",
        "Salt to taste",
        "Water as required",
        "Juice of half a lemon"
    ],
    "steps": [
        {
            "title": "Soak Jeerakasala Rice",
            "description": "Rinse the jeerakasala rice 2–3 times until the water runs clear. Soak it in water for 30 minutes."
        },
        {
            "title": "Fry Onions for Garnishing",
            "description": "Heat oil in a pan. Add thinly sliced onions and shallow-fry on medium heat until golden brown. Remove and drain on paper towels."
        },
        {
            "title": "Sauté Cashews and Raisins",
            "description": "In the same or a separate pan, heat ghee and sauté cashews until golden. Add raisins and sauté until they puff up. Set aside for garnishing."
        },
        {
            "title": "Marinate Chicken Lightly",
            "description": "In a bowl, mix chicken with a little salt and turmeric. Let it sit for about 10 minutes."
        },
        {
            "title": "Sear the Chicken",
            "description": "Heat oil in a heavy-bottomed pan. Add the marinated chicken and sear on high heat until the outside is lightly browned."
        },
        {
            "title": "Add Aromatics and Tomatoes",
            "description": "Lower the heat and add ginger-garlic paste. Sauté until raw smell disappears. Add green chilies and chopped tomatoes. Cook until tomatoes soften."
        },
        {
            "title": "Add Spices and Yogurt",
            "description": "Mix in red chili powder, coriander powder, and garam masala. Stir well. Add yogurt and cook until the masala thickens and coats the chicken."
        },
        {
            "title": "Simmer Chicken Until Cooked",
            "description": "Cover the pan and cook the chicken on low heat until tender and fully cooked. Stir occasionally to prevent burning."
        },
        {
            "title": "Boil Water with Whole Spices",
            "description": "In a separate large vessel, bring ample water to a boil. Add whole spices, salt, and a few drops of oil."
        },
        {
            "title": "Cook the Rice",
            "description": "Add the soaked rice to the boiling water. Cook until 90% done – the grains should be soft but still firm in the center. Drain and set aside."
        },
        {
            "title": "Layer Chicken and Rice",
            "description": "In a deep pot, spread the cooked chicken masala at the bottom. Layer half of the cooked rice on top."
        },
        {
            "title": "Add Herbs and Garnishes",
            "description": "Sprinkle half of the chopped mint, coriander, fried onions, and lemon juice over the rice layer."
        },
        {
            "title": "Repeat Layering",
            "description": "Add the remaining rice as the second layer. Top with the rest of the mint, coriander, and fried onions."
        },
        {
            "title": "Seal and Dum Cook",
            "description": "Cover the pot with a tight lid or seal with dough. Place over very low heat and cook for 15–20 minutes to allow the flavors to meld."
        },
        {
            "title": "Rest Before Serving",
            "description": "Let the biryani rest for 10 minutes after dum. This helps settle the layers and enhance flavor."
        },
        {
            "title": "Garnish and Serve",
            "description": "Gently fluff the top rice with a fork. Garnish with fried cashews and raisins before serving."
        },
        {
            "title": "Miscellaneous / Intro & Outro",
            "description": "Covers all non-recipe content such as video greetings, channel promotions, personal stories, thanks messages, like/share/subscribe prompts, and other commentary unrelated to cooking instructions."
        }
    ]
}